MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFE144/mcu.h
extern volatile __SBT11RD0bits_t SBT11RD0bits __asm__ ("SBT11RD0") __attribute__((section("sfrs"), address(0xBF8FAC50)));
#define SBT11WR0 SBT11WR0
extern volatile uint32_t   SBT11WR0 __attribute__((section("sfrs"), address(0xBF8FAC58)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT11WR0bits_t;
extern volatile __SBT11WR0bits_t SBT11WR0bits __asm__ ("SBT11WR0") __attribute__((section("sfrs"), address(0xBF8FAC58)));
#define SBT11REG1 SBT11REG1
extern volatile uint32_t   SBT11REG1 __attribute__((section("sfrs"), address(0xBF8FAC60)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT11REG1bits_t;
extern volatile __SBT11REG1bits_t SBT11REG1bits __asm__ ("SBT11REG1") __attribute__((section("sfrs"), address(0xBF8FAC60)));
#define SBT11RD1 SBT11RD1
extern volatile uint32_t   SBT11RD1 __attribute__((section("sfrs"), address(0xBF8FAC70)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT11RD1bits_t;
extern volatile __SBT11RD1bits_t SBT11RD1bits __asm__ ("SBT11RD1") __attribute__((section("sfrs"), address(0xBF8FAC70)));
#define SBT11WR1 SBT11WR1
extern volatile uint32_t   SBT11WR1 __attribute__((section("sfrs"), address(0xBF8FAC78)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT11WR1bits_t;
extern volatile __SBT11WR1bits_t SBT11WR1bits __asm__ ("SBT11WR1") __attribute__((section("sfrs"), address(0xBF8FAC78)));
#define SBT12ELOG1 SBT12ELOG1
extern volatile uint32_t   SBT12ELOG1 __attribute__((section("sfrs"), address(0xBF8FB020)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT12ELOG1bits_t;
extern volatile __SBT12ELOG1bits_t SBT12ELOG1bits __asm__ ("SBT12ELOG1") __attribute__((section("sfrs"), address(0xBF8FB020)));
#define SBT12ELOG2 SBT12ELOG2
extern volatile uint32_t   SBT12ELOG2 __attribute__((section("sfrs"), address(0xBF8FB024)));
typedef struct {
  uint32_t GROUP:2;
} __SBT12ELOG2bits_t;
extern volatile __SBT12ELOG2bits_t SBT12ELOG2bits __asm__ ("SBT12ELOG2") __attribute__((section("sfrs"), address(0xBF8FB024)));
#define SBT12ECON SBT12ECON
extern volatile uint32_t   SBT12ECON __attribute__((section("sfrs"), address(0xBF8FB028)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT12ECONbits_t;
extern volatile __SBT12ECONbits_t SBT12ECONbits __asm__ ("SBT12ECON") __attribute__((section("sfrs"), address(0xBF8FB028)));
#define SBT12ECLRS SBT12ECLRS
extern volatile uint32_t   SBT12ECLRS __attribute__((section("sfrs"), address(0xBF8FB030)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT12ECLRSbits_t;
extern volatile __SBT12ECLRSbits_t SBT12ECLRSbits __asm__ ("SBT12ECLRS") __attribute__((section("sfrs"), address(0xBF8FB030)));
#define SBT12ECLRM SBT12ECLRM
extern volatile uint32_t   SBT12ECLRM __attribute__((section("sfrs"), address(0xBF8FB038)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT12ECLRMbits_t;
extern volatile __SBT12ECLRMbits_t SBT12ECLRMbits __asm__ ("SBT12ECLRM") __attribute__((section("sfrs"), address(0xBF8FB038)));
#define SBT12REG0 SBT12REG0
extern volatile uint32_t   SBT12REG0 __attribute__((section("sfrs"), address(0xBF8FB040)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT12REG0bits_t;
extern volatile __SBT12REG0bits_t SBT12REG0bits __asm__ ("SBT12REG0") __attribute__((section("sfrs"), address(0xBF8FB040)));
#define SBT12RD0 SBT12RD0
extern volatile uint32_t   SBT12RD0 __attribute__((section("sfrs"), address(0xBF8FB050)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT12RD0bits_t;
extern volatile __SBT12RD0bits_t SBT12RD0bits __asm__ ("SBT12RD0") __attribute__((section("sfrs"), address(0xBF8FB050)));
#define SBT12WR0 SBT12WR0
extern volatile uint32_t   SBT12WR0 __attribute__((section("sfrs"), address(0xBF8FB058)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT12WR0bits_t;
extern volatile __SBT12WR0bits_t SBT12WR0bits __asm__ ("SBT12WR0") __attribute__((section("sfrs"), address(0xBF8FB058)));
#define SBT13ELOG1 SBT13ELOG1
extern volatile uint32_t   SBT13ELOG1 __attribute__((section("sfrs"), address(0xBF8FB420)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT13ELOG1bits_t;
extern volatile __SBT13ELOG1bits_t SBT13ELOG1bits __asm__ ("SBT13ELOG1") __attribute__((section("sfrs"), address(0xBF8FB420)));
#define SBT13ELOG2 SBT13ELOG2
extern volatile uint32_t   SBT13ELOG2 __attribute__((section("sfrs"), address(0xBF8FB424)));
typedef struct {
  uint32_t GROUP:2;
} __SBT13ELOG2bits_t;
extern volatile __SBT13ELOG2bits_t SBT13ELOG2bits __asm__ ("SBT13ELOG2") __attribute__((section("sfrs"), address(0xBF8FB424)));
#define SBT13ECON SBT13ECON
extern volatile uint32_t   SBT13ECON __attribute__((section("sfrs"), address(0xBF8FB428)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT13ECONbits_t;
extern volatile __SBT13ECONbits_t SBT13ECONbits __asm__ ("SBT13ECON") __attribute__((section("sfrs"), address(0xBF8FB428)));
#define SBT13ECLRS SBT13ECLRS
extern volatile uint32_t   SBT13ECLRS __attribute__((section("sfrs"), address(0xBF8FB430)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT13ECLRSbits_t;
extern volatile __SBT13ECLRSbits_t SBT13ECLRSbits __asm__ ("SBT13ECLRS") __attribute__((section("sfrs"), address(0xBF8FB430)));
#define SBT13ECLRM SBT13ECLRM
extern volatile uint32_t   SBT13ECLRM __attribute__((section("sfrs"), address(0xBF8FB438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT13ECLRMbits_t;
extern volatile __SBT13ECLRMbits_t SBT13ECLRMbits __asm__ ("SBT13ECLRM") __attribute__((section("sfrs"), address(0xBF8FB438)));
#define SBT13REG0 SBT13REG0
extern volatile uint32_t   SBT13REG0 __attribute__((section("sfrs"), address(0xBF8FB440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT13REG0bits_t;
