MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFE144/mcu.h
#define _CNSTATB_CNSTATB7_POSITION               0x00000007
#define _CNSTATB_CNSTATB7_MASK                   0x00000080
#define _CNSTATB_CNSTATB7_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB8_POSITION               0x00000008
#define _CNSTATB_CNSTATB8_MASK                   0x00000100
#define _CNSTATB_CNSTATB8_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB9_POSITION               0x00000009
#define _CNSTATB_CNSTATB9_MASK                   0x00000200
#define _CNSTATB_CNSTATB9_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB10_POSITION              0x0000000A
#define _CNSTATB_CNSTATB10_MASK                  0x00000400
#define _CNSTATB_CNSTATB10_LENGTH                0x00000001

#define _CNSTATB_CNSTATB11_POSITION              0x0000000B
#define _CNSTATB_CNSTATB11_MASK                  0x00000800
#define _CNSTATB_CNSTATB11_LENGTH                0x00000001

#define _CNSTATB_CNSTATB12_POSITION              0x0000000C
#define _CNSTATB_CNSTATB12_MASK                  0x00001000
#define _CNSTATB_CNSTATB12_LENGTH                0x00000001

#define _CNSTATB_CNSTATB13_POSITION              0x0000000D
#define _CNSTATB_CNSTATB13_MASK                  0x00002000
#define _CNSTATB_CNSTATB13_LENGTH                0x00000001

#define _CNSTATB_CNSTATB14_POSITION              0x0000000E
#define _CNSTATB_CNSTATB14_MASK                  0x00004000
#define _CNSTATB_CNSTATB14_LENGTH                0x00000001

#define _CNSTATB_CNSTATB15_POSITION              0x0000000F
#define _CNSTATB_CNSTATB15_MASK                  0x00008000
#define _CNSTATB_CNSTATB15_LENGTH                0x00000001

#define _CNSTATB_w_POSITION                      0x00000000
#define _CNSTATB_w_MASK                          0xFFFFFFFF
#define _CNSTATB_w_LENGTH                        0x00000020

#define _CNNEB_CNNEB3_POSITION                   0x00000003
#define _CNNEB_CNNEB3_MASK                       0x00000008
#define _CNNEB_CNNEB3_LENGTH                     0x00000001

#define _CNNEB_CNNEB5_POSITION                   0x00000005
#define _CNNEB_CNNEB5_MASK                       0x00000020
#define _CNNEB_CNNEB5_LENGTH                     0x00000001

#define _CNNEB_CNNEB8_POSITION                   0x00000008
#define _CNNEB_CNNEB8_MASK                       0x00000100
#define _CNNEB_CNNEB8_LENGTH                     0x00000001

#define _CNNEB_CNNEB9_POSITION                   0x00000009
#define _CNNEB_CNNEB9_MASK                       0x00000200
#define _CNNEB_CNNEB9_LENGTH                     0x00000001

#define _CNNEB_CNNEB10_POSITION                  0x0000000A
#define _CNNEB_CNNEB10_MASK                      0x00000400
#define _CNNEB_CNNEB10_LENGTH                    0x00000001

#define _CNNEB_CNNEB14_POSITION                  0x0000000E
#define _CNNEB_CNNEB14_MASK                      0x00004000
#define _CNNEB_CNNEB14_LENGTH                    0x00000001

#define _CNFB_CNFB0_POSITION                     0x00000000
#define _CNFB_CNFB0_MASK                         0x00000001
#define _CNFB_CNFB0_LENGTH                       0x00000001

#define _CNFB_CNFB1_POSITION                     0x00000001
#define _CNFB_CNFB1_MASK                         0x00000002
#define _CNFB_CNFB1_LENGTH                       0x00000001

#define _CNFB_CNFB2_POSITION                     0x00000002
#define _CNFB_CNFB2_MASK                         0x00000004
#define _CNFB_CNFB2_LENGTH                       0x00000001

#define _CNFB_CNFB3_POSITION                     0x00000003
#define _CNFB_CNFB3_MASK                         0x00000008
#define _CNFB_CNFB3_LENGTH                       0x00000001

#define _CNFB_CNFB4_POSITION                     0x00000004
#define _CNFB_CNFB4_MASK                         0x00000010
#define _CNFB_CNFB4_LENGTH                       0x00000001

#define _CNFB_CNFB5_POSITION                     0x00000005
#define _CNFB_CNFB5_MASK                         0x00000020
#define _CNFB_CNFB5_LENGTH                       0x00000001

#define _CNFB_CNFB6_POSITION                     0x00000006
#define _CNFB_CNFB6_MASK                         0x00000040
#define _CNFB_CNFB6_LENGTH                       0x00000001

#define _CNFB_CNFB7_POSITION                     0x00000007
#define _CNFB_CNFB7_MASK                         0x00000080
#define _CNFB_CNFB7_LENGTH                       0x00000001

#define _CNFB_CNFB8_POSITION                     0x00000008
#define _CNFB_CNFB8_MASK                         0x00000100
#define _CNFB_CNFB8_LENGTH                       0x00000001

#define _CNFB_CNFB9_POSITION                     0x00000009
#define _CNFB_CNFB9_MASK                         0x00000200
#define _CNFB_CNFB9_LENGTH                       0x00000001

#define _CNFB_CNFB10_POSITION                    0x0000000A
#define _CNFB_CNFB10_MASK                        0x00000400
#define _CNFB_CNFB10_LENGTH                      0x00000001

#define _CNFB_CNFB11_POSITION                    0x0000000B
#define _CNFB_CNFB11_MASK                        0x00000800
#define _CNFB_CNFB11_LENGTH                      0x00000001

#define _CNFB_CNFB12_POSITION                    0x0000000C
#define _CNFB_CNFB12_MASK                        0x00001000
#define _CNFB_CNFB12_LENGTH                      0x00000001

#define _CNFB_CNFB13_POSITION                    0x0000000D
#define _CNFB_CNFB13_MASK                        0x00002000
#define _CNFB_CNFB13_LENGTH                      0x00000001

#define _CNFB_CNFB14_POSITION                    0x0000000E
#define _CNFB_CNFB14_MASK                        0x00004000
#define _CNFB_CNFB14_LENGTH                      0x00000001

#define _CNFB_CNFB15_POSITION                    0x0000000F
#define _CNFB_CNFB15_MASK                        0x00008000
#define _CNFB_CNFB15_LENGTH                      0x00000001

#define _SRCON0B_SR0B0_POSITION                  0x00000000
#define _SRCON0B_SR0B0_MASK                      0x00000001
#define _SRCON0B_SR0B0_LENGTH                    0x00000001

#define _SRCON0B_SR0B1_POSITION                  0x00000001
#define _SRCON0B_SR0B1_MASK                      0x00000002
#define _SRCON0B_SR0B1_LENGTH                    0x00000001

#define _SRCON0B_SR0B2_POSITION                  0x00000002
#define _SRCON0B_SR0B2_MASK                      0x00000004
#define _SRCON0B_SR0B2_LENGTH                    0x00000001

#define _SRCON0B_SR0B3_POSITION                  0x00000003
#define _SRCON0B_SR0B3_MASK                      0x00000008
#define _SRCON0B_SR0B3_LENGTH                    0x00000001

#define _SRCON0B_SR0B4_POSITION                  0x00000004
#define _SRCON0B_SR0B4_MASK                      0x00000010
#define _SRCON0B_SR0B4_LENGTH                    0x00000001

#define _SRCON0B_SR0B5_POSITION                  0x00000005
#define _SRCON0B_SR0B5_MASK                      0x00000020
#define _SRCON0B_SR0B5_LENGTH                    0x00000001

